[{"ProductId":"587ff326-bb80-44ae-91f7-0eb625fd71bb","ProductName":"SHUXING Fashion Handbag","productImageModel":[{"imageName":"21daf712-b2ff-424b-9575-f460b4033246_bag1.jpg","imageSize":38557},{"imageName":"41e8e0b6-559b-4352-a5f8-0c1ddfdeba1a_bag2.jpg","imageSize":27032},{"imageName":"50398ba9-d75b-4a18-ab34-c021be44fe5a_bag3.jpg","imageSize":20419},{"imageName":"6e4ec143-b903-4b55-95fa-de1202de6335_bag4.jpg","imageSize":37395}],"ShortDescription":"SHUXING Fashion Handbag Atmospheric All-match Lady Shoulder Bag Messenger Bag","LongDescription":"· Backpack material:\r\n\r\n·     The backpack is mainly made of high-quality fabrics, which is durable and healthy, and improves the service life of the bag. The compact handle is more comfortable to lift by one hand. The reinforced stitching at all joints makes the backpack more durable.\r\n\r\n·     Personalized design, more leisurely and beautiful, suitable for most people, versatile in everyday life.\r\n\r\n·     This cute and stylish backpack will surprise everyone. It is very suitable for students, children, women and other people of all ages. Suitable for school, shopping, sports, camping, hiking, travel and vacation. Highly recommended to elementary school/kindergarten/preschool, etc. It is also a good choice as a holiday gift on Christmas, back to school, Thanksgiving or some special days.\r\n\r\n·     Please note: Due to the possible physical differences between different displays (such as model, settings, color gamut, panel type, screen glare, etc.), product images are for illustrative purposes only and may not accurately reflect the actual colors of the goods received.\r\n\r\n·     Note: Due to manual measurement, there may be a difference of 1-3 cm. Please choose the right one according to your actual situation. If you are satisfied with our products and services, we sincerely hope that you can give us a positive feedback and a detailed 5-star seller rating.\r\n\r\n· About SHUXING: SHUXING always puts the quality of the products first, never changes, puts all enthusiasm into every detail, and perfectly blends inspiration and exquisite craftsmanship. We design natural, practical, simple and fashionable products, including classic series, official document series, casual series, colorful series; at the same time, we also continue the British retro series and customized series.\r\n\r\n·    Finally, I hope that every customer can find products that really belong to you in our shop. I wish you a happy shopping in this shop. You give us a trust and we give you a surprise. Enjoy your every day!","Price":11000.0,"ActualPrice":7700.0,"PercentageOff":30,"Quantity":5,"InStock":true,"Category":["Bags"]},{"ProductId":"90ba7d91-a792-4176-a2a2-46bcde000ad2","ProductName":"Ladies PU Leather Handbag","productImageModel":[{"imageName":"e06243e0-6834-4191-be55-c32492698306_bag21.jpg","imageSize":60880},{"imageName":"6a6cc5e9-8c83-49f9-bf96-d2ccfa81656d_bag22.jpg","imageSize":58498},{"imageName":"64481c39-1afb-4a57-bbb5-6fe395e06891_bag23.jpg","imageSize":39626},{"imageName":"f8178981-45f3-4359-96aa-37ceedf2681f_bag24.jpg","imageSize":45106}],"ShortDescription":"Ladies PU Leather Handbag Shoulder Bag Messenger Bag+ Silk Scarf (gift)","LongDescription":"Multiple spaces to meet your various needs\r\nThe leather shoulder bag is made of PU with a zipper on the top.\r\nThe leather material has a natural leather smell, please let it dry for a few days, the smell will disappear\r\nRefined by hand, the texture is soft and delicate, with a heavy feel. Handcrafted can add glamour to every refined high-end handbag.\r\nWomen's tote with adjustable shoulder straps can be used as a tote, shoulder bag or tote. Suitable for women who are shopping, working, dating or in everyday life","Price":16765.0,"ActualPrice":9053.10,"PercentageOff":46,"Quantity":6,"InStock":true,"Category":["Bags"]},{"ProductId":"44a4b718-f04a-4315-bb9d-5913b7d39754","ProductName":"Aihontai 100% Premium Quality Laptop","productImageModel":[{"imageName":"e51e0624-ca0a-40a9-a7d9-4a5ab98cb9df_bag31.jpg","imageSize":37146},{"imageName":"1c31ad45-6b76-48e5-b0b5-fa37ccf92c2e_bag32.jpg","imageSize":33243},{"imageName":"85842a85-1306-414c-ab4a-518cdb89b8be_bag33.jpg","imageSize":48680},{"imageName":"17850553-9fca-4766-bd65-cddeecdfa868_bag44.jpg","imageSize":58215}],"ShortDescription":"Aihontai 100% Premium Quality Laptop Bag With 9 Compartments.Travel Bag/School Bag/Backpack Bag For ","LongDescription":"100% Premium Quality Laptop Bag With 9 Compartments.Travel Bag/School Bag/Backpack Bag For Laptop,Tablets,Phone,Watches.Etc.With Quality Quality Zipper,Strong Stitches. BLACK\r\nHave you been looking for a quality laptop bag that can serve as a travel bag too? A backpack that will offer maximum protections to your laptop, ipad, phone screen and body in case of accidental falls? A bag with solid zippers, stitches, Buckles, 9 spacious compartments to contain every vital belongings of your you need for the day. A bag you can pack in your vital belongings when you want to embark on a trip?\r\nIf your answers to the above questions are YES, then this premium quality laptop bag/travel bag/school bag is what you need. I can beat my hands on my chest and tell you that you will never regret buying this bag. This is the best choice you will make today because the bag possesses these amazing features and many more that you will find out when you see and feel the perfect work of the manufacturer of this quality bag.\r\nThe zips for the pockets are easy to open and close to access the inside items\r\nFashionable style which is not easy outdated, you can keep using for a long time.\r\nGreat companion for shopping, travel, holiday, flights, vacation, dog walking.\r\nNeat and strong stitches.","Price":9118.0,"ActualPrice":5926.70,"PercentageOff":35,"Quantity":8,"InStock":true,"Category":["Bags"]},{"ProductId":"0c4075de-bd56-485c-b828-3b1ab011ca63","ProductName":"SHUXING 3Pcs Backpack With Lunch Bag Pencil Case","productImageModel":[{"imageName":"16379d57-908b-41cb-af13-f5a3bce29267_bag41.jpg","imageSize":53830},{"imageName":"73462597-0e91-4cb2-b014-9f52da635e9b_bag42.jpg","imageSize":74002},{"imageName":"d7b2ad8f-e54e-4f24-8da1-6b3b0d02f89c_bag43.jpg","imageSize":55428},{"imageName":"d4f0c186-fa17-4150-b666-283595de4fc0_bag45.jpg","imageSize":34466}],"ShortDescription":"SHUXING 3Pcs Backpack With Lunch Bag Pencil Case","LongDescription":"ECO-FRIENDLY: Help close the loop on fabric waste! Our recycled material is an earth-friendly alternative. We also invest in quality so you won't have to buy new every year.\r\nDURABLE: We use 900-denier, heavy-duty canvas, compared to 600-denier used by most national brands. Our zippers are quality tested to stand up to daily use.\r\nSPACIOUS & LAPTOP FRIENDLY: Large enough to fit books, binders, and laptops, but small enough to be comfortably wearable for Kids and Adults. Contains two internal compartments, inner and outer zipper pockets, and an external mesh water bottle pocket. Fits most laptops in the padded computer pocket.\r\nAbout SHUXING Bags \r\nAll our SHUXING Bags are sent Directly from the Factory, which can ensure that consumers are able to enjoy the best quality Bags at the lowest price. \r\nSHUXING provide consumers with the best after-sales service. If you are not satisfied with the product received, don't hesitate to contact us in time, we will provide you with a exchange or return service as soon as possible.","Price":12500.0,"ActualPrice":7500.0,"PercentageOff":40,"Quantity":6,"InStock":true,"Category":["Bags"]},{"ProductId":"235a715d-9b66-4689-ae2b-cc7277dde29e","ProductName":" Lunch Box Bento Tote Stor","productImageModel":[{"imageName":"8fccf9a4-637e-48f0-9aaf-6ba91752a546_bag51.jpg","imageSize":68833},{"imageName":"b61b4e2f-712c-419d-91b8-04b666617c45_bag52.jpg","imageSize":58535},{"imageName":"9567a841-f502-4146-bb92-78af082d538e_bag53.jpg","imageSize":51198},{"imageName":"5d3985d2-0f53-416c-b590-d22d1a10cb00_bag54.jpg","imageSize":38363}],"ShortDescription":"Portable Insulated Thermal Cooler Lunch Box Bento Tote Stor","LongDescription":"Lunch Box Bag Tote Hot Cold Insulated Thermal Cooler Work School Travel Picnic\r\n\r\nSpecifications:\r\n: Blue\r\nSize: As the picture\r\nMaterial: Oxford fabric, aluminum foil\r\n\r\nFeatures:\r\n- Keep hot and cold for hours , double-decked insulation lunch bag. Simple Care: interior wipes clean, spot clean exterior.\r\n- EASY CARRYING: with convenient grab handles for carrying by hand. A single adjustable shoulder strap.\r\n- Casual life use: excellent for work lunches, school kids, picnic, travel, camping, beach and outdoor sporting events, as well mom bag.","Price":9514.0,"ActualPrice":7325.78,"PercentageOff":23,"Quantity":8,"InStock":true,"Category":["Bags"]},{"ProductId":"533a7391-bd03-4d5b-bff0-1704773fbfd0","ProductName":" Diaper Backpack","productImageModel":[{"imageName":"4c9fa898-f513-4e41-a943-42da3c8b082e_bag61.jpg","imageSize":37583},{"imageName":"5db0147d-7fef-4b2e-ab06-1660aa35a5a1_bag62.jpg","imageSize":33202},{"imageName":"5cea7988-aa0b-4068-b0a7-d619af04e583_bag63.jpg","imageSize":17794},{"imageName":"e64d92a8-630c-4a8d-be97-57e7102bc2a8_bag64.jpg","imageSize":34397}],"ShortDescription":"Mummy Diaper Backpack Mummy Bag Large Capacity Bag Baby Nursing Bag","LongDescription":"Women Zipper Maternity Travel Backpack Large Capacity Baby Backpack Nursing Shoulder BagsCharacteristics:The fashion version of the type: concise but not simple high-grade Oxford cloth, extraordinary quality;Exquisite design: simple and generous fashion;Easy to carry: Heavy forward, convenient and practical.\r\nSpecifications:Material: Oxford clothLining: cotton polyester (inner material random)Size: 440X380X160mm/17.32X14.96X6.3\"Use: mom backpackNet weight: 535gShape: Vertical SquareMaterial technology: smooth surfaceSTYLE: large capacity casualStrap: adjustable strapColor: MulticolorRemarks:1. Due to the different monitors and light effects, the actual color of the item might be slightly different from the color showed on the pictures. Thank you!2. Please allow 1-3cm deviation due to manual measurement.","Price":9000.0,"ActualPrice":4950.00,"PercentageOff":45,"Quantity":11,"InStock":true,"Category":["Bags"]},{"ProductId":"6f7b35bb-c7de-47b9-b4c7-0b04f4c2028c","ProductName":"Men's Belt With Black Alloy","productImageModel":[{"imageName":"cb500bb7-bdf4-4704-b6f8-c3f593e2f7e4_belt1.jpg","imageSize":88476},{"imageName":"130d2611-a1de-47d2-b016-0811d20a9454_belt2.jpg","imageSize":84008},{"imageName":"02e5d42a-fc18-4966-854b-2ea0dd210e4a_belt3.jpg","imageSize":58567}],"ShortDescription":"Trendy Adjustable Men's Belt With Black Alloy Automatic Clasp","LongDescription":"This belt is unique and classy\r\nThis Unique design adds the perfect detail to your outfit, giving it an edge. Simply stylish and elegant. This belt is the perfect accessory for Jeans and Trousers. Finish your outfit with our edit of men's belts. From classic black belts to bold and colourful designs, we've got something for everyone, whatever your style. Hit us up for Western details, statement buckles and woven finishes, or browse designer belts from and check out the variety of colours and textures on offer, with a choice of bold or subtle logo details. \r\nThis belt is unique and classy\r\nThis Unique design adds the perfect detail to your outfit, giving it an edge. Simply stylish and elegant. This belt is the perfect accessory for Jeans and Trousers. Finish your outfit with our edit of men's belts. From classic black belts to bold and colourful designs, we've got something for everyone, whatever your style. Hit us up for Western details, statement buckles and woven finishes, or browse designer belts from and check out the variety of colours and textures on offer, with a choice of bold or subtle logo details. This belt is unique and classy\r\nThis Unique design adds the perfect detail to your outfit, giving it an edge. Simply stylish and elegant. This belt is the perfect accessory for Jeans and Trousers. Finish your outfit with our edit of men's belts. From classic black belts to bold and colourful designs, we've got something for everyone, whatever your style. Hit us up for Western details, statement buckles and woven finishes, or browse designer belts from and check out the variety of colours and textures on offer, with a choice of bold or subtle logo details. This belt is unique and classy\r\nThis Unique design adds the perfect detail to your outfit, giving it an edge. Simply stylish and elegant. This belt is the perfect accessory for Jeans and Trousers. Finish your outfit with our edit of men's belts. From classic black belts to bold and colourful designs, we've got something for everyone, whatever your style. Hit us up for Western details, statement buckles and woven finishes, or browse designer belts from and check out the variety of colours and textures on offer, with a choice of bold or subtle logo details. ","Price":4500.0,"ActualPrice":3015.00,"PercentageOff":33,"Quantity":8,"InStock":true,"Category":["Belt"]},{"ProductId":"596aa431-45e6-4b3f-80ac-66b85467533f","ProductName":"Men's Leather Belt Belts ","productImageModel":[{"imageName":"81243fb5-da76-44de-b24d-7cd03d202845_belt21.jpg","imageSize":59338},{"imageName":"f27aaba0-6120-4733-b1d7-9c66f4a812a7_belt22.jpg","imageSize":61312},{"imageName":"abc95bd7-23bc-4536-bf94-bae1f8187745_belt23.jpg","imageSize":69218},{"imageName":"83c050e3-9c2d-4e94-aeec-6a7a8858c6bb_belt24.jpg","imageSize":45628}],"ShortDescription":"Dinisiton Men's Leather Belt Belts For Mens High Quality","LongDescription":"This leather belt for men is fashionable and of high quality.This men's belt can be used in all seasons and can match all shapes. No matter what status you wear, no matter how you match, it can match your needs.The men's belt is made of pure full grain leather, which feels smooth and colorful.Culture and product design are inspired by deep traditional culture.All products conform to the outdoor lifestyle and aim to give back to the community.A classic black or brown formal belt with a high quality double-sided topside belt, perfect for choosing a daily clean look, professional looking for business meetings, or fashion design for weddings, the belt is individually packaged for any occasion where you want to look perfect.Provide stylish, high quality straps and buckles that you can wear with pride or give away as a gift.Only this belt, durable, beautiful surface with fashion belt, fashion belt design elegant, chic, for you to create a delicate finishing touch, impressive.This leather belt pursues the unique leather, takes the world's high quality leather to achieve the best durability.Looking for the perfect match with your black wardrobe.Want an unforgettable gift for a special person in your life.This belt is your best choice!","Price":18220.0,"ActualPrice":10932.0,"PercentageOff":40,"Quantity":8,"InStock":true,"Category":["Belt"]},{"ProductId":"8042815e-2b82-47f8-8a24-e9bc19153761","ProductName":"Nos High Quality Canvas Belts - Beige","productImageModel":[{"imageName":"2fad2626-f654-4236-91af-5d9011fd4268_belt31.jpg","imageSize":48709},{"imageName":"d0217b08-3003-4596-83ce-792d71925cc1_belt32.jpg","imageSize":21682},{"imageName":"754c370b-3f4b-4f21-9c17-44930263c759_belt33.jpg","imageSize":14466}],"ShortDescription":"Nos High Quality Canvas Belts - Beige","LongDescription":"High Quality Military Style Canvas Belts With Stainless Steel Buckle.\r\n\r\nGreat for the individual who had been looking for a full width and attractive \r\n\r\nbuckle belt. It is suitable for both men and women and comes with assorted\r\n\r\ncolors, stripes and plain.\r\n\r\nThe belts can be adjusted if too long as indicated on product pictures.","Price":8000.0,"ActualPrice":6480.00,"PercentageOff":19,"Quantity":12,"InStock":true,"Category":["Belt"]},{"ProductId":"eae76e54-2b14-48c7-a097-2c086c01bc6a","ProductName":"Mens Leather Vintage","productImageModel":[{"imageName":"cc8954e8-ae23-42c2-adcf-22cc21ca8453_belt41.jpg","imageSize":44251},{"imageName":"e14d3088-86cb-4c85-9e05-25e28e31e1d3_belt42.jpg","imageSize":35671},{"imageName":"668b57f2-1ed3-456c-8968-84a9fa3453de_belt43.jpg","imageSize":50832},{"imageName":"cbfe194d-5725-4c9c-9b3c-2ef1796df147_belt44.jpg","imageSize":47831}],"ShortDescription":"Mens Leather Vintage Metal Automatic Buckle Waist Band Brown","LongDescription":"Product Category: Leather Belt\r\n\r\n2. Applicable Gender: Male\r\n\r\n3. With Metal Automatic Buckle\r\n\r\n4. Material: Leather\r\n\r\n5. Processing Methods: Embossing\r\n\r\n6. Material Of Belt Buckle: Alloy\r\n\r\n7. Length: 110-120cm /47.24'' (include buckle)\r\n\r\n8. Width: 3.7cm/1.46''\r\n\r\n9. Fit Waistline:approx. 100 -110cm/39.37''-43.30''(you can cut as you want )\r\n\r\n10. Thickness: 4mm\r\n","Price":6029.0,"ActualPrice":4039.43,"PercentageOff":33,"Quantity":13,"InStock":true,"Category":["Belt"]},{"ProductId":"71dc0cdb-3909-4284-95a7-0b4e63b739ca","ProductName":"Men Dark Shades Bluetooth Glasses","productImageModel":[{"imageName":"ebde8a49-b7eb-455f-9c76-262bc48d9b2e_glasses1.jpg","imageSize":32887},{"imageName":"0d2db411-0059-438a-9b8c-8e4ebe831d52_glasses2.jpg","imageSize":34744},{"imageName":"f455f5db-ff02-4a68-b096-7f498b5d30bd_glasses3.jpg","imageSize":25440},{"imageName":"7823c6cd-95dd-42d2-8ef6-f139d2581a76_glasses4.jpg","imageSize":19254}],"ShortDescription":"Men Dark Shades Bluetooth Glasses Sunshades Polarized Sunglasses","LongDescription":"1. 100% and high quality.\r\n2. This item is the perfect combination of practicability and fashion\r\n3. Fashionable design with foldable eyeglasses.\r\n4. Earphones built directly on to the frame, and can be adjusted for comfortable fit. \r\n5. It can works for all Bluetooth mobile phones, you can enjoy hands-free talk with your friends\r\n6.Telephone talking mode when calling in and out. \r\n7. Call Accept/Reject/End\r\n8. Auto power off\r\n9. With mini USB port and rechargeable built-in lithium battery\r\n10. Suitable for any Bluetooth enabled cell phone \r\n11. Great for sports activities","Price":5519.0,"ActualPrice":3863.3,"PercentageOff":30,"Quantity":7,"InStock":true,"Category":["Sunglasses"]},{"ProductId":"fd61240c-df0d-4182-9fce-bd1515635b9f","ProductName":"Sunglasses Men","productImageModel":[{"imageName":"1dcbf5c3-fbfa-43f7-abbb-842f8c48357a_glasses21.jpg","imageSize":56734},{"imageName":"585808c5-b208-4457-9ee2-53654e4fae9d_glasses22.jpg","imageSize":18442},{"imageName":"cf2e1ca1-d95a-468d-b6a6-9f1b75057405_glasses23.jpg","imageSize":35067},{"imageName":"24f01b37-a8de-4a40-9170-5f776167b9e9_glasses24.jpg","imageSize":17232}],"ShortDescription":"BOYSEEN New Indian Explosion Sunglasses Men Retro Thick Edge Metal Frame Trend Sunglasses 58157X","LongDescription":"Glasses maintenance1. When putting on or taking off the glasses, please use both hands: gently hold the temples, and remove it with one hand will destroy the left and right balance; when wiping the lens, please hold the middle beam of the frame with one hand (do not hold the lens Leg), wipe gently with one hand, otherwise the frame may be deformed or the screws may loosen over time.2. When placing, do not place the lens face down: the lens face should be placed up or up, if placed down, place the most important lens center for wear.3. Fold the frame from the top first: Most frames are designed to fold from the top, so if you fold to the right first, it will be more laborious and will cause the frame to deform.4. When wiping the lens, please try to use a special lens cloth or soft paper towel: do not use corners or hand towels to wipe the lens. When the lens is heavily stained or dusty, it is best to use a neutral detergent (for example, detergent, etc.) to rinse with water, and then gently wipe with a lens cloth, otherwise the lens may be worn.5. Use a dry cloth or paper towel to wipe the sweat and oil stains on the frame and nose pad: You can wipe with a small amount of soap and water to remove difficult-to-remove dirt, or perform ultrasonic cleaning at the optician.6. Try to avoid contact with water vapor, oil fume, sweat, and certain cosmetics: these substances have a strong corrosive effect, and the film layer of the lens will cause certain damage. For the purpose of glasses and extended warranty The service life should be isolated.7. Do not use in high and low temperature environments: do not put the glasses on the control panel of the car exposed to the sun or bathe with the glasses, so as to avoid the overall deformation and deformation of the glasses. When outdoor activities are particularly cold, please pay attention to prevent the board frame from becoming brittle or cracked.8. After putting on the glasses, please check whether the screws are loose: If the screws are loose, please tighten the screws in time (preferably go to the glasses shop) to prevent lens displacement or parts loss.","Price":4475.0,"ActualPrice":2864.00,"PercentageOff":36,"Quantity":6,"InStock":true,"Category":["Sunglasses"]},{"ProductId":"29644693-9917-4227-9bfb-77428c8b0541","ProductName":"Anti Blue Light Protective","productImageModel":[{"imageName":"858695d5-3995-440c-8490-7df33613f623_glasses31.jpg","imageSize":72237},{"imageName":"b116bbff-92e1-47f9-ae59-671b0fa916b6_glasses32.jpg","imageSize":31401},{"imageName":"202dc093-6a24-44a7-a32e-9102b414d5b5_glasses33.jpg","imageSize":38492},{"imageName":"b2af3d87-130f-474f-90bf-3fbf6b6f42e5_glasses34.jpg","imageSize":40613}],"ShortDescription":"Unisex Anti Blue Light Protective Computer Screen Glasses","LongDescription":"We live totally surrounded by screens, spending almost nine hours a day, on average, in front of digital devices. All these devices emit blue light, and since our eyes aren't protected against this overexposure, the light can be detrimental.\r\nWHAT IS BLUE LIGHT?Blue light is a harmful portion of light emitted by digital screens. According to the Paris Vision Institute, younger people exposed to an excess amount of blue light can start to experience age-related macular degeneration at an earlier stage. Other research states that excess exposure is also the leading cause of vision loss for people over 50.\r\n\r\nHOW TO PROTECT YOUR EYESBlue light blocking glasses from our store are specially designed to filter out harmful blue-violet light. This makes screen time more comfortable and help eliminate symptoms of digital eyestrain. Simultaneously, this Blu-ray filter glasses will improve your sleep and make you fall asleep.","Price":5000.0,"ActualPrice":1650.00,"PercentageOff":67,"Quantity":5,"InStock":true,"Category":["Sunglasses"]},{"ProductId":"99846e16-0041-426e-add4-7509ca7c151f","ProductName":"Photochromic Sunglasses","productImageModel":[{"imageName":"1cc006c5-60f4-4748-8859-26055a489f45_glasses41.jpg","imageSize":41971},{"imageName":"02478157-6ad4-48cc-ae15-4582ccddee5c_glasses42.jpg","imageSize":52633},{"imageName":"d05a3145-21c8-4c24-9b4e-756e6643f530_glasses43.jpg","imageSize":23467},{"imageName":"7e32b50a-1965-41c7-8440-a99bb32e8ba5_glasses44.jpg","imageSize":41026}],"ShortDescription":"Photochromic Sunglasses With Polarized Lens Anti Glare Driver Sunglasses","LongDescription":"Our sunglasses are made of special photochromic polarized lenses. When driving at night or into a dark environment, the lenses are lightcolored transparent to enhancing the visibility while effectively reducing the glare. During the daytime, it can effectively filter the strong light, enhance the visual sharpness, reduce eyes fatigue, and keep the eyes always in the most comfortable state of outdoor activities.\r\n\r\nLight Grey Glasses (Photochromic)\r\n\r\nPhotochromic Technology\r\n\r\nThis type of lens features a substantial photochromic effect. It is not totally transparent, and its color also changes according to how much it absorbs UV rays (ultraviolet radiation).\r\n\r\nPhotochromic lenses change in color under different light conditions. They darken when exposed to strong sunlight, which can effectively protect your eyes from over-exposure. Our photochromic lenses will change in color only when exposed to UV rays, which means the lenses won’t change colour while you’re inside of your car or somewhere there are no UV rays.\r\n\r\nThe photochromic lenses detect the intensity of light change and absorb ultraviolet rays automatically. When exposed to intenser sunlight, they will turn darker and at the same time they offer ultimate blockage against UV rays to keep your eyes comfortable by helping you see more clearly and relieving eye strain.\r\n\r\nAt night or in dark tunnels, these lenses will become clear again very quick, providing sharper vision and longer sight distance for your eyes to see the surroundings clearly.\r\nimageimageimageimageimageimage","Price":6299.0,"ActualPrice":3275.48,"PercentageOff":48,"Quantity":6,"InStock":true,"Category":["Sunglasses"]},{"ProductId":"eccec24d-7af8-4d73-a71c-35d7dc415268","ProductName":"Men's Casual Shoes-Black","productImageModel":[{"imageName":"ecb1cacd-7bd5-423e-8a6f-f371be50dc7b_sneakers1.jpg","imageSize":50641},{"imageName":"05b15aa2-dd82-4923-a483-3f746dfe0bd7_sneakers2.jpg","imageSize":61965},{"imageName":"71b1cd57-2b6b-422d-99f6-d1cd8b1888c4_sneakers3.jpg","imageSize":41740},{"imageName":"d0aef88b-3688-4034-842b-49d3217a314c_sneakers4.jpg","imageSize":28368}],"ShortDescription":"Men's Casual Shoes-Black","LongDescription":"This pair in addition to being comfortable is very stylish. A must have for the classic man.We've got the best prices and service.This shoes is more convenient to wear shoes, showing a uniform and smooth line texture, simple and generous.Lightweight rubber outsole: with a soft, cushioned rubber sole for an elegant, stylish and simple. Clear texture design, Strong grip, non-slip, wear-resistant. So durable rubber outsole delivers traction on a variety of surfaces. Comfortable and delicate fabric: exudes natural luster, highlights the quality, and shows men's casual style. Comfortable lining: According to ergonomics, the inner part is made of breathable and foot-fitting material, so that your feet can keep breathing smoothly and easily meet the needs of life.Simple and Fashionable, Soft and Comfortable, Lightweight and wear-resistant，it is perfect for daily use.This classic monk single buckle shoes features Genuine Leather upper, slip on design for easy on/off wear, and monk shoes detailing on side for added style. Moreover, It is finished with smooth leather Lining, cushioned footbed for comfort, and non-skid outsole. This kind of shoes you wear, jeans or pants collocation, make you reflect the tough temperament!Featuring durable outsoles that enable easy traction, it is also very comfortable. A perfect match with semi-casual and official outfits.If you were not satisfied with something please contact us before you leave us a Negative feedback.we will always try our best for 100% customer satisfaction.That's why we are here! All emails will be answered within 48 hours (Sat. & Sun. excluded). So please do not hesitate to email us!The size of this shoe is a bit too small,please buy a size larger than the usual shoes.","Price":7500.0,"ActualPrice":5025.00,"PercentageOff":33,"Quantity":6,"InStock":true,"Category":["Sneakers"]},{"ProductId":"b1ee012b-3c12-423d-ad6c-dc64a1f78caf","ProductName":"Men's Mesh Breathable Fashion Sneakers -Green","productImageModel":[{"imageName":"7b565bad-6060-4946-a64b-672933765a5b_sneakers22.jpg","imageSize":43853},{"imageName":"0f18b507-ed0c-4a04-bf46-93b603e9c55e_sneakers23.jpg","imageSize":86790},{"imageName":"a6854e9b-b027-4522-88a9-385e71fb9622_sneakers24.jpg","imageSize":117646},{"imageName":"c7906f42-a580-4a49-9527-5e89c42d43bf_sneakers25.jpg","imageSize":65079}],"ShortDescription":"Men's Mesh Breathable Fashion Sneakers -Green","LongDescription":"- Hello there! Welcome to our store 【Forbidden City-COD】! Quality is our number one priority!\r\n\r\nOur store focuses on African fashion. Believe me you own one of our products enough to show off like your friends.\r\n\r\nTo avoid choosing the wrong size, read the size label carefully.\r\n\r\n【Please select a size based on \"foot length\".】\r\n\r\nIf the feet are thick and wide, buy shoes of a larger size; if the shoes are too large, it is recommended to wear insoles.\r\n\r\nSize reference (our shoes are EU sizes)\r\n\r\n★ EU size 40 = China size 40 = foot length 25.0 cm.\r\n\r\n★ EU size 41 = China size 41 = foot length 25.5 cm.\r\n\r\n★ EU size 42 = China size 42 = foot length 26.0 cm.\r\n\r\n★ EU size 43 = China size 43 = foot length 26.5 cm.\r\n\r\n★ EU size 44 = China size 44 = foot length 27.0 cm.\r\n\r\n★ EU size 45 = China size 45 = foot length 27.5 cm.\r\n\r\nWhich is both soft and protective, so you can perform every step with ease. Durability. Stable on the ground.\r\n\r\nAre you always looking for a store with the best ideas, inspiration and soul? Pay attention to us, we can always surprise you.\r\n\r\nIf the project is good, give it a five-star rating. Your compliment is the driving force of our continuous efforts.","Price":12000.0,"ActualPrice":2760.00,"PercentageOff":77,"Quantity":12,"InStock":true,"Category":["Sneakers"]},{"ProductId":"f1d929e7-55f8-4928-b4a6-5b92941cc674","ProductName":"2021 Men's Casual Running Sneakers","productImageModel":[{"imageName":"1182cd6a-3f63-45af-acf8-90fc4bc09cb6_sneakers31.jpg","imageSize":65192},{"imageName":"a04f1e77-472e-4f12-8a81-e3c78686394d_sneakers32.jpg","imageSize":47652},{"imageName":"d13373d9-633f-46d0-ba70-6d18ed9143f2_sneakers33.jpg","imageSize":69964},{"imageName":"69c338d0-9782-444f-beec-069b8052dfc7_sneakerss34.jpg","imageSize":54048}],"ShortDescription":"2021 Men's Casual Running Sneakers Black","LongDescription":"This is a black high-top sneaker, fashionable and trendy, with a confident accent.\r\nThe classic round toe cap has a good performance in waterproof and anti-collision, bringing you comfort and safety, every step is enjoyment. The upper is made of high-quality leather with a very good texture. The lining of the shoes is made of breathable lining, which has good wear resistance and breathability, and is comfortable and dry to wear. Rubber sole, soft and fashionable, stable and non-slip. The heel is stitched in black, in a fashionable and classic color scheme.\r\nThese shoes are very suitable for men who pursue fashion and classics. They are versatile for casual, fashionable and business wear to meet daily wear needs.\r\n\r\nStyle: Casual，Sport.\r\nMain Material: Leather.\r\nFeatures: Comfortable，Durable，Very Cool.\r\nOccasions: Sports、Casual、Office、Outdoor、Dating、Everyday、Shopping.","Price":10776.0,"ActualPrice":10237.20,"PercentageOff":5,"Quantity":10,"InStock":true,"Category":["Sneakers"]},{"ProductId":"2e2c0a8b-072d-4eed-a2a1-32615baeb3c1","ProductName":"2021 Men's Casual High-Top Shoes- Beige","productImageModel":[{"imageName":"12c8b447-7350-45fb-9024-e4c2c7cc4464_sneakers41.jpg","imageSize":69967},{"imageName":"3dc87375-23de-490f-b833-9ed01436680a_sneakers42.jpg","imageSize":37222},{"imageName":"7ecd794f-6b43-462b-897c-0cb20d324403_sneakers43.jpg","imageSize":68436},{"imageName":"bd598c0c-4a45-4f8e-9543-767cc6fd2bd9_sneakers44.jpg","imageSize":66539}],"ShortDescription":"2021 Men's Casual High-Top Shoes- Beige","LongDescription":"This pair of shoes uses beige, white and beige classic colors, following the trend of the times, this year's most popular must-have choice in Europe and America.\r\nSneakers made of high-quality materials, combined with innovative and exquisite craftsmanship, combine performance and modern fashion!\r\nThe rubber sole is soft and has excellent elasticity, which can adapt to various sports and play the role of shock absorption.\r\n\r\nStyle: Classic Design.\r\nShoes Upper: Leather + PU.\r\nShoes Sole: Rubber Sole.\r\nFeatures: New Sport、Breathable、Hard-Wearing、Increase Height\r\nOccasions: Sports、Casual、Office、Outdoor、Dating、Everyday、Shopping.\r\nSeason: Spring、Summer、Autumn.\r\n","Price":13333.0,"ActualPrice":7199.82,"PercentageOff":46,"Quantity":16,"InStock":true,"Category":["Sneakers"]}]